app/controllers/account_controller.rb

	def create
		@ranks = Rank.all
		@user = User.new(params[:user])
		if @user.save
---
SELECT * FROM "ranks"
INSERT INTO "users" ("name", "updated_at", "login", "password", "identifier", "email", "created_at") VALUES(NULL, '2010-04-11 23:04:57', NULL, 'abc1234', NULL, 'test@readywise.com', '2010-04-11 23:04:57')

	def new
		@ranks = Rank.all
---
SELECT * FROM "ranks"