app/controllers/badges_controller.rb

  def show

     @rank = Rank.find(params[:rank_id])
     @ranks = Rank.all
     @badge = @rank.badges.find(params[:id])
---
SELECT * FROM "ranks" WHERE ("ranks"."id" = 1)
SELECT * FROM "ranks"
SELECT * FROM "badges" WHERE ("badges"."id" = 1 AND ("badges".rank_id = 1))