app/controllers/home_controller.rb

SELECT * FROM "ranks"
---
  def index
    @ranks = Rank.all