app/controllers/ranks_controller.rb

SELECT * FROM "ranks"
---
  def index
    @ranks = Rank.all

SELECT * FROM "ranks" WHERE ("ranks"."id" = 1)
SELECT * FROM "ranks"
SELECT * FROM "badges" WHERE ("badges".rank_id = 2) LIMIT 1
SELECT * FROM "achievements" WHERE ("achievements".badge_id = 4)
---
  def show
    #@rank = Rank.find_by_name(params[:name])
    @rank = Rank.find(params[:id])
 @ranks = Rank.all
 @badges = @rank.badges
 @badge = @rank.badges.first
 @achievements = @rank.badges.first.achievements

SELECT * FROM "ranks" WHERE ("ranks"."id" = 1)
---
  def edit
    @rank = Rank.find(params[:id])

INSERT INTO "ranks" ("name", "updated_at", "created_at") VALUES('Wolf', '2010-02-12 20:41:51', '2010-02-12 20:41:51')
---
  def create
    @rank = Rank.new(params[:rank])

    respond_to do |format|
      if @rank.save

SELECT * FROM "ranks" WHERE ("ranks"."id" = 1)
UPDATE "ranks" SET "name" = 'Tiger', "updated_at" = '2010-02-12 20:41:38' WHERE "id" = 1
---
  def update
    @rank = Rank.find(params[:id])

    respond_to do |format|
      if @rank.update_attributes(params[:rank])

SELECT * FROM "ranks" WHERE ("ranks"."id" = 980190962)
DELETE FROM "ranks" WHERE "id" = 980190962
---
  def destroy
    @rank = Rank.find(params[:id])
    @rank.destroy