app/controllers/users_controller.rb

SELECT * FROM "ranks"
SELECT * FROM "users"
---
  def index
  	@ranks = Rank.all
    @users = User.all

SELECT * FROM "ranks"
---
  def new
  	@ranks = Rank.all

SELECT * FROM "ranks"
INSERT INTO "users" ("name", "updated_at", "login", "password", "identifier", "email", "created_at") VALUES('bryanthankins', '2010-02-21 23:43:42', NULL, NULL, 'https://www.google.com/accounts/o8/id?id=AItOawmbs5SDDbvswL4atqjyL3cmxL2HzKn7hVs', 'bryanthankins@gmail.com', '2010-02-21 23:43:42')
SELECT * FROM "users" WHERE ("users"."identifier" = 'https://www.google.com/accounts/o8/id?id=AItOawmbs5SDDbvswL4atqjyL3cmxL2HzKn7hVs') LIMIT 1
---
def create
		@ranks = Rank.all
  u = URI.parse('https://rpxnow.com/api/v2/auth_info')
  req = Net::HTTP::Post.new(u.path)
  req.set_form_data({'token' => params[:token],
                      'apiKey' => 'bcc2de236838231be15aad6d81751f1cc63e642a',  # <-- your RPX api key here.
                      'format' => 'json'})

  http = Net::HTTP.new(u.host,u.port)
  http.use_ssl = true if u.scheme == 'https'
  res = http.request(req)

  json_resp = res.body
  json = JSON.parse(json_resp)

  if json['stat'] == 'ok'
    unique_identifier = json['profile']['identifier']
    username = json['profile']['preferredUsername']
    nickname = json['profile']['displayName'] if nickname.nil?
    email = json['profile']['email']
    photo_url = json['profile']['photo']



    # implement your own do_success method which signs the user in
    # to your website
    #do_success(unique_identifier,email,nickname,photo_url)
    data = {:name => username, :email => email, :identifier => unique_identifier}
  self.current_user = User.find_by_identifier(data[:identifier]) || User.create!(data)

SELECT * FROM "tasks" WHERE ("tasks"."id" = 5)
---
 def save_tasks
 	logger.debug "made it here!"
 	@user = self.current_user #User.find(params[:id])
    @task = Task.find(params[:task])